{"project_id": "P170640", "document_text": "The World Bank\n Public Information and Awareness Campaign for COVID-19 in Mongolia. The development objective of the project is to strengthen the capacity of the Government of Mongolia to respond to the COVID-19 pandemic through public information campaigns and awareness activities. The project will support health education, community engagement and risk communication activities. Key components include: (1) Public awareness and communication; (2) Health system strengthening; (3) Project management and monitoring.", "document_type": "APPROVAL"}
{"project_id": "P007810", "document_text": "Document of\nThe World Bank\nFOR OFFICIAL USE ONLY\nReport No. 12345-BR\nBrazil Agricultural Development Project. The objective of the project is to increase agricultural productivity and improve the livelihoods of smallholder farmers in the northeastern region of Brazil. The project supports sustainable farming practices, irrigation infrastructure, and market access improvements. Component A: Irrigation and water management infrastructure development. Component B: Agricultural extension services and capacity building. Component C: Market linkages and value chain development.", "document_type": "APPROVAL"}
{"project_id": "P002034", "document_text": "Document of\nFILE COPY The World Bank\nFOR OFFICIAL USE ONLY\nIndia Rural Water Supply Project. This project aims to provide safe drinking water and sanitation facilities to rural communities in selected districts of India. The project will improve water supply infrastructure, strengthen institutional capacity for water resource management, and promote hygiene education. Expected outcomes include reduced waterborne diseases, improved access to clean water, and enhanced community participation in water management.", "document_type": "APPROVAL"}
{"project_id": "P003542", "document_text": "Document of\nThe World Bank\nFOR OFFICIAL USE ONLY\nImplementation Completion and Results Report on Kenya Education Sector Support Project. The project aimed to improve access to quality education in Kenya through school construction, teacher training, and curriculum development. Results: The project successfully constructed 250 schools, trained 5,000 teachers, and developed new curriculum materials. However, some targets for enrollment were not fully met due to delays in construction. Overall project rating: Moderately Satisfactory.", "document_type": "REVIEW"}
{"project_id": "P109683", "document_text": "Independent Evaluation Group (IEG) Implementation Completion Report Review for Vietnam Urban Development Project. Project objectives were to improve urban infrastructure and services in secondary cities. The project financed roads, drainage systems, solid waste management, and public spaces. IEG rates the outcome as moderately satisfactory. Key lessons: (1) Strong local government ownership is critical; (2) Integrated urban planning improves project sustainability; (3) Community participation enhances project outcomes.", "document_type": "REVIEW"}
{"project_id": "P112345", "document_text": "", "document_type": "APPROVAL"}
{"project_id": "P003542", "document_text": "Document of\nThe World Bank\nFOR OFFICIAL USE ONLY\nImplementation Completion and Results Report on Kenya Education Sector Support Project. The project aimed to improve access to quality education in Kenya through school construction, teacher training, and curriculum development. Results: The project successfully constructed 250 schools, trained 5,000 teachers, and developed new curriculum materials. However, some targets for enrollment were not fully met due to delays in construction. Overall project rating: Moderately Satisfactory.", "document_type": "REVIEW"}
{"project_id": "P223456", "document_text": "The World Bank -- Ethiopia Health Extension Program. The program supports the deployment of 30,000+ health extension workers across rural Ethiopia to provide basic health services including maternal care, immunization, malaria prevention and nutrition education. This is the second phase building on lessons from Phase I which demonstrated significant reductions in under-5 mortality and improved maternal health outcomes. Key challenges include: (i) retention of health workers in remote areas; (ii) supply chain management for essential medicines; (iii) quality supervision and monitoring.", "document_type": "APPROVAL"}
{"project_id": "P334567", "document_text": null, "document_type": "REVIEW"}
{"project_id": "P445678", "document_text": "Bangladesh     Flood     Protection    and    Drainage     Project.  The   World  Bank   supports   Bangladesh   government   efforts   to   protect   low-lying   areas   from   recurring   floods   through   construction   of   embankments,   drainage   channels   and   flood   shelters.   USD   200   million   allocated.   Expected   beneficiaries:   3   million   people.   Implementation   period:   2018-2024.", "document_type": "APPROVAL"}
{"project_id": "P556789", "document_text": "IEG Review: Colombia Peace and Development Project @#$% RATING: Satisfactory!!! The project contributed significantly to post-conflict reconstruction in affected regions. <html>Some artifacts from OCR scanning</html> Activities included: infrastructure rehabilitation, livelihood support, & community reconciliation programs. Contact: info@worldbank.org for more details. Visit https://www.worldbank.org/projects/P556789 for full documentation.", "document_type": "REVIEW"}
{"project_id": "P667890", "document_text": "12345 67890 11111 22222 33333 44444 55555 66666 77777 88888 99999 00000 12345 67890 numbers only document this should be flagged", "document_type": "APPROVAL"}
{"project_id": "P778901", "document_text": "Philippines Disaster Risk Management Project. World Bank support for strengthening disaster preparedness and response capacity. Components: (1) Early warning systems; (2) Evacuation infrastructure; (3) Community-based disaster risk reduction; (4) Post-disaster recovery mechanisms. Budget: USD 500M. The Philippines is one of the most disaster-prone countries, experiencing an average of 20 typhoons per year. This project builds on previous World Bank engagements in disaster risk management in the East Asia and Pacific region.", "document_type": "APPROVAL"}
{"project_id": "P889012", "document_text": "Tanzania Agricultural Sector Development Program - Implementation Completion Report. The program aimed to transform smallholder agriculture through improved technologies, market access, and institutional strengthening. Key Results: (a) 45% increase in crop yields for participating farmers; (b) 30% increase in farm income; (c) 200,000 farmers adopted improved practices. Challenges: Climate variability affected some regions. Sustainability: Moderate risk due to continued dependence on external funding. Rating: Satisfactory.", "document_type": "REVIEW"}
{"project_id": "P990123", "document_text": "Morocco Renewable Energy Development Project Appraisal Document. Objective: Scale up renewable energy generation capacity to reduce dependence on fossil fuel imports and lower carbon emissions. The project will finance: (i) 500MW solar PV installations; (ii) 200MW wind farms; (iii) Grid modernization and energy storage; (iv) Technical assistance and capacity building. Environmental and Social Assessment: Category B. Expected CO2 reduction: 1.5 million tons per year. Economic rate of return: 18%.", "document_type": "APPROVAL"}
